% плотность распределения 1 / (x * log(10))
% интервал распределения [0 : 10]
% Дискретные случайные велечины
%P{𝑋 = 𝑘𝑖} = 𝑝𝑖; 𝑝 = {0.05,0.1,0.2,0.3,0.2,0.1,0.05} 𝑘 = 4,5, . . . ,10

n_size = [50,200,1000];
k_values = [4, 5, 6, 7, 8, 9, 10];
p_values = [0.05, 0.1, 0.2, 0.3, 0.2, 0.1, 0.05];
func = 1 / (x * ln(10)); % плотность распределения
x_min = 0; % нижний порог интегрирования
x_max = 10; % верхний порог интегрирования
peremennaya = integral(func,x_min,x_max);
z = 0:1;
S = z;

for i=1:lenght(n_size)
    %функция
end
%while i <= N
%    S = S - probabilities(i);
%    if S < 0
%        xi = i;
%    else
%        i = i + 1;
%    end
%end

fprintf('Случайная переменная z: %.4fn', z);
fprintf('Значение интервала x_i: %dn', xi);